import logging
import random

logger = logging.getLogger(__name__)

class FunService:
    def __init__(self):
        self.facts = [
            "Коты спят около 70% своей жизни.",
            "Мёд никогда не портится - археологи находили съедобный мёд в древнеегипетских гробницах!",
            "Сердце креветки находится в её голове.",
            "Вы не сможете чихнуть с открытыми глазами.",
            "Осьминоги имеют три сердца и голубую кровь.",
            "В Японии есть мост, который соединяет два острова и при этом является действующим водоводом.",
            "Бананы - это ягоды, а клубника - нет.",
            "В Швейцарии незаконно иметь только одну морскую свинку, потому что они скучают в одиночестве.",
            "Крокодилы не могут высовывать язык.",
            "Если сложить все числа на рулетке, получится 666."
        ]

    def get_random_fact(self) -> str:
        """Получение случайного интересного факта"""
        return random.choice(self.facts)